RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL43Z4/fsl_sim_hal_MKL43Z4.h
/*******************************************************************************
* API
******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus*/

/*!
 * @addtogroup sim_hal
 * @{
 */

/*!
 * @brief Enable the clock for specific module.
 *
 * This function enables the clock for specific module.
 *
 * @param base Base address for current SIM instance.
 * @param name Name of the module to enable.
 */
static inline void SIM_HAL_EnableClock(SIM_Type * base, sim_clock_gate_name_t name)
{
    SIM_BWR_SCGC_BIT(base, name, 1U);
}

/*!
* @brief Disable the clock for specific module.
*
* This function disables the clock for specific module.
*
* @param base Base address for current SIM instance.
* @param name Name of the module to disable.
*/
static inline void SIM_HAL_DisableClock(SIM_Type * base, sim_clock_gate_name_t name)
{
    SIM_BWR_SCGC_BIT(base, name, 0U);
}

/*!
* @brief Get the the clock gate state for specific module.
*
* This function will get the clock gate state for specific module.
*
* @param base Base address for current SIM instance.
* @param name Name of the module to get.
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool SIM_HAL_GetGateCmd(SIM_Type * base, sim_clock_gate_name_t name)
{
    return (bool)SIM_BRD_SCGC_BIT(base, name);
}

/*!
* @brief Set the clock selection of LPUART.
*
* This function sets the clock selection of LPUART.
*
* @param base Base address for current SIM instance.
* @param instance LPUART instance.
* @param setting  The value to set.
*/
void CLOCK_HAL_SetLpuartSrc(SIM_Type * base,
                            uint32_t instance,
                            clock_lpuart_src_t setting);

/*!
* @brief Get the clock selection of LPUART.
*
* This function gets the clock selection of LPUART.
*
* @param base Base address for current SIM instance.
* @param instance LPUART instance.
* @return Current selection.
*/
clock_lpuart_src_t CLOCK_HAL_GetLpuartSrc(SIM_Type * base,
                                          uint32_t instance);

/*!
* @brief Set the clock selection of TPM.
*
* This function sets the clock selection of TPM.
*
* @param base Base address for current SIM instance.
* @param instance IP instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetTpmSrc(SIM_Type * base,
                                       uint32_t instance,
                                       clock_tpm_src_t setting)
{
    SIM_BWR_SOPT2_TPMSRC(base, setting);
}

/*!
* @brief Get the clock selection of TPM.
*
* This function gets the clock selection of TPM.
*
* @param base Base address for current SIM instance.
* @param instance IP instance.
* @return Current selection.
*/
static inline clock_tpm_src_t CLOCK_HAL_GetTpmSrc(SIM_Type * base,
                                                  uint32_t instance)
{
    return (clock_tpm_src_t)SIM_BRD_SOPT2_TPMSRC(base);
}

#if FSL_FEATURE_SOC_USB_COUNT
/*!
 * @brief Set the selection of the clock source for the USB FS 48 MHz clock.
 *
 * This function sets the selection of the clock source for the USB FS 48 MHz clock.
 *
 * @param base Base address for current SIM instance.
 * @param instance IP instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetUsbfsSrc(SIM_Type * base,
                                         uint32_t instance,
                                         clock_usbfs_src_t setting)
{
    SIM_BWR_SOPT2_USBSRC(base, setting);
}

/*!
 * @brief Get the selection of the clock source for the USB FS 48 MHz clock.
 *
 * This function gets the selection of the clock source for the USB FS 48 MHz clock.
 *
 * @param base Base address for current SIM instance.
 * @param instance IP instance.
 * @return Current selection.
 */
static inline clock_usbfs_src_t CLOCK_HAL_GetUsbfsSrc(SIM_Type * base,
                                                      uint32_t instance)
{
    return (clock_usbfs_src_t)SIM_BRD_SOPT2_USBSRC(base);
}
#endif// FSL_FEATURE_SOC_USB_COUNT

/*!
 * @brief Select the clock source for FLEXIO.
 *
 * This function selects the clock source for FLEXIO.
 *
 * @param base Base address for current SIM instance.
 * @param instance IP instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetFlexioSrc(SIM_Type * base,
                                          uint32_t instance,
                                          clock_flexio_src_t setting)
{
    SIM_BWR_SOPT2_FLEXIOSRC(base, setting);
}

/*!
 * @brief Get the clock source of FLEXIO.
 *
 * This function gets the clock source of FLEXIO.
 *
 * @param base Base address for current SIM instance.
 * @param instance IP instance.
 * @return Current selection.
 */
static inline clock_flexio_src_t CLOCK_HAL_GetFlexioSrc(SIM_Type * base,
                                                        uint32_t instance)
{
    return (clock_flexio_src_t)SIM_BRD_SOPT2_FLEXIOSRC(base);
}

/*!
* @brief Set the clock ERCLK32K output on selected pin.
*
* This function sets ERCLK32K output on selected pin.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetOsc32kOutSel(SIM_Type * base,
                                             clock_osc32kout_sel_t setting)
{
    SIM_BWR_SOPT1_OSC32KOUT(base, setting);
}

/*!
* @brief Get output status of ERCLK32K.
*
* This function gets the output status of ERCLK32K.
*
* @param base Base address for current SIM instance.
* @return Current selection.
*/
static inline clock_osc32kout_sel_t CLOCK_HAL_GetOsc32kOutSel(SIM_Type * base)
{
    return (clock_osc32kout_sel_t)SIM_BRD_SOPT1_OSC32KOUT(base);
}


/*!
* @brief Set the clock selection of ERCLK32K.
*
* This function sets the clock selection of ERCLK32K.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetExternalRefClock32kSrc(SIM_Type * base,
                                                       clock_er32k_src_t setting)
{
    SIM_BWR_SOPT1_OSC32KSEL(base, setting);
}

/*!
* @brief Get the clock selection of ERCLK32K.
*
* This function gets the clock selection of ERCLK32K.
*
* @param base Base address for current SIM instance.
* @return Current selection.
*/
static inline clock_er32k_src_t CLOCK_HAL_GetExternalRefClock32kSrc(SIM_Type * base)
{
    return (clock_er32k_src_t)SIM_BRD_SOPT1_OSC32KSEL(base);
}

/*!
* @brief Set CLKOUTSEL selection.
*
* This function sets the selection of the clock to output on the CLKOUT pin.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetClkOutSel(SIM_Type * base, clock_clkout_src_t setting)
{
    SIM_BWR_SOPT2_CLKOUTSEL(base, setting);
}

/*!
* @brief Get CLKOUTSEL selection.
*
* This function gets the selection of the clock to output on the CLKOUT pin.
*
* @param base Base address for current SIM instance.
* @return Current selection.
*/
static inline clock_clkout_src_t CLOCK_HAL_GetClkOutSel(SIM_Type * base)
{
    return (clock_clkout_src_t)SIM_BRD_SOPT2_CLKOUTSEL(base);
}

/*!
* @brief Set RTCCLKOUTSEL selection.
*
* This function sets the selection of the clock to output on the RTC_CLKOUT pin.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetRtcClkOutSel(SIM_Type * base,
                                             clock_rtcout_src_t setting)
{
    SIM_BWR_SOPT2_RTCCLKOUTSEL(base, setting);
}

/*!
* @brief Get RTCCLKOUTSEL selection.
*
* This function gets the selection of the clock to output on the RTC_CLKOUT pin.
*
* @param base Base address for current SIM instance.
* @return Current selection.
*/
static inline clock_rtcout_src_t CLOCK_HAL_GetRtcClkOutSel(SIM_Type * base)
{
    return (clock_rtcout_src_t)SIM_BRD_SOPT2_RTCCLKOUTSEL(base);
}


/*!
* @brief Set the clock selection of COP.
*
* This function sets the clock selection of COP.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetCopSrc(SIM_Type * base,
                                       clock_cop_src_t setting)
{
    SIM_BWR_COPC_COPCLKSEL(base, setting);
}

/*!
* @brief Get the clock selection of COP.
*
* This function gets the clock selection of COP.
*
* @param base Base address for current SIM instance.
* @return Current selection.
*/
static inline clock_cop_src_t CLOCK_HAL_GetCopSrc(SIM_Type * base)
{
    return (clock_cop_src_t)SIM_BRD_COPC_COPCLKSEL(base);
}


/*!
* @brief Set OUTDIV1.
*
* This function sets divide value OUTDIV1.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetOutDiv1(SIM_Type * base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV1(base, setting);
}

/*!
* @brief Get OUTDIV1.
*
* This function gets divide value OUTDIV1.
*
* @param base Base address for current SIM instance.
* @return Current divide value.
*/
static inline uint8_t CLOCK_HAL_GetOutDiv1(SIM_Type * base)
{
    return SIM_BRD_CLKDIV1_OUTDIV1(base);
}

/*!
* @brief Set OUTDIV4.
*
* This function sets divide value OUTDIV4.
*
* @param base Base address for current SIM instance.
* @param setting  The value to set.
*/
static inline void CLOCK_HAL_SetOutDiv4(SIM_Type * base, uint8_t setting)
{
    SIM_BWR_CLKDIV1_OUTDIV4(base, setting);
}

/*!
* @brief Get OUTDIV4.
*
* This function gets divide value OUTDIV4.
*
* @param base Base address for current SIM instance.
* @return Current divide value.
*/
static inline uint8_t CLOCK_HAL_GetOutDiv4(SIM_Type * base)
{
    return SIM_BRD_CLKDIV1_OUTDIV4(base);
}

/*!
 * @brief Sets the clock out dividers setting.
 *
 * This function sets the setting for all clock out dividers at the same time.
 *
 * @param base     Base address for current SIM instance.
 * @param outdiv1      Outdivider1 setting
 * @param outdiv2      Outdivider2 setting
 * @param outdiv3      Outdivider3 setting
 * @param outdiv4      Outdivider4 setting
 */
void CLOCK_HAL_SetOutDiv(SIM_Type * base,
                         uint8_t outdiv1,
                         uint8_t outdiv2,
                         uint8_t outdiv3,
                         uint8_t outdiv4);

/*!
 * @brief Gets the clock out dividers setting.
 *
 * This function gets the setting for all clock out dividers at the same time.
 *
 * @param base     Base address for current SIM instance.
 * @param outdiv1      Outdivider1 setting
 * @param outdiv2      Outdivider2 setting
 * @param outdiv3      Outdivider3 setting
 * @param outdiv4      Outdivider4 setting
 */
void CLOCK_HAL_GetOutDiv(SIM_Type * base,
                         uint8_t *outdiv1,
                         uint8_t *outdiv2,
                         uint8_t *outdiv3,
                         uint8_t *outdiv4);

#if FSL_FEATURE_SOC_USB_COUNT
/*!
 * @brief Sets the USB voltage regulator enabled setting.
 *
 * This function  controls whether the USB voltage regulator is enabled. This bit
 * can only be written when the SOPT1CFG[URWE] bit is set.
 *
 * @param base     Base address for current SIM instance.
 * @param enable   USB voltage regulator enable setting
 *                  - true: USB voltage regulator is enabled.
 *                  - false: USB voltage regulator is disabled.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorCmd(SIM_Type * base, bool enable)
{
    SIM_BWR_SOPT1_USBREGEN(base, enable ? 1 : 0);
}

/*!
 * @brief Gets the USB voltage regulator enabled setting.
 *
 * This function  gets the USB voltage regulator enabled setting.
 *
 * @param base     Base address for current SIM instance.
 * @return enabled True if the USB voltage regulator is enabled.
 */
static inline bool SIM_HAL_GetUsbVoltRegulatorCmd(SIM_Type * base)
{
    return SIM_BRD_SOPT1_USBREGEN(base);
}

/*!
 * @brief Sets the USB voltage regulator in a standby mode setting during Stop, VLPS, LLS, and VLLS.
 *
 * This function  controls whether the USB voltage regulator is placed in a standby
 * mode during Stop, VLPS, LLS, and VLLS modes. This bit can only be written when the
 * SOPT1CFG[USSWE] bit is set.
 *
 * @param base     Base address for current SIM instance.
 * @param setting   USB voltage regulator in standby mode setting
 *                  - 0: USB voltage regulator not in standby during Stop, VLPS, LLS and
 *                       VLLS modes.
 *                  - 1: USB voltage regulator in standby during Stop, VLPS, LLS and VLLS
 *                       modes.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorInStdbyDuringStopMode(SIM_Type * base,
                                                                    sim_usbsstby_mode_t setting)
{
    SIM_BWR_SOPT1_USBSSTBY(base, setting);
}

/*!
 * @brief Gets the USB voltage regulator in a standby mode setting.
 *
 * This function  gets the USB voltage regulator in a standby mode setting.
 *
 * @param base     Base address for current SIM instance.
 * @return setting  USB voltage regulator in a standby mode setting
 */
static inline sim_usbsstby_mode_t SIM_HAL_GetUsbVoltRegulatorInStdbyDuringStopMode(SIM_Type * base)
{
    return (sim_usbsstby_mode_t)SIM_BRD_SOPT1_USBSSTBY(base);
}

/*!
 * @brief Sets the USB voltage regulator in a standby mode during the VLPR or the VLPW.
 *
 * This function  controls whether the USB voltage regulator is placed in a standby
 * mode during the VLPR and the VLPW modes. This bit can only be written when the
 * SOPT1CFG[UVSWE] bit is set.
 *
 * @param base     Base address for current SIM instance.
 * @param setting   USB voltage regulator in standby mode setting
 *                  - 0: USB voltage regulator not in standby during VLPR and VLPW modes.
 *                  - 1: USB voltage regulator in standby during VLPR and VLPW modes.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorInStdbyDuringVlprwMode(SIM_Type * base,
                                                                     sim_usbvstby_mode_t setting)
{
    SIM_BWR_SOPT1_USBVSTBY(base, setting);
}

/*!
 * @brief Gets the USB voltage regulator in a standby mode during the VLPR or the VLPW.
 *
 * This function  gets the USB voltage regulator in a standby mode during the VLPR or the VLPW.
 *
 * @param base     Base address for current SIM instance.
 * @return setting  USB voltage regulator in a standby mode during the VLPR or the VLPW
 */
static inline sim_usbvstby_mode_t SIM_HAL_GetUsbVoltRegulatorInStdbyDuringVlprwMode(SIM_Type * base)
{
    return (sim_usbvstby_mode_t)SIM_BRD_SOPT1_USBVSTBY(base);
}

/*!
 * @brief Sets the USB voltage regulator stop standby write enable setting.
 *
 * This function  controls whether the USB voltage regulator stop  standby write
 * feature is enabled. Writing one to this bit allows the SOPT1[USBSSTBY] bit to be written. This
 * register bit clears after a write to SOPT1[USBSSTBY].
 *
 * @param base     Base address for current SIM instance.
 * @param enable  USB voltage regulator stop standby write enable setting
 *                  - true: SOPT1[USBSSTBY] can be written.
 *                  - false: SOPT1[USBSSTBY] cannot be written.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorInStdbyDuringStopCmd(SIM_Type * base, bool enable)
{
    SIM_BWR_SOPT1CFG_USSWE(base, enable ? 1 : 0);
}

/*!
 * @brief Gets the USB voltage regulator stop standby write enable setting.
 *
 * This function  gets the USB voltage regulator stop standby write enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return enabled True if the USB voltage regulator stop standby write is enabled.
 */
static inline bool SIM_HAL_GetUsbVoltRegulatorInStdbyDuringStopCmd(SIM_Type * base)
{
    return SIM_BRD_SOPT1CFG_USSWE(base);
}

/*!
 * @brief Sets the USB voltage regulator VLP standby write enable setting.
 *
 * This function  controls whether USB voltage regulator VLP standby write
 * feature is enabled. Writing one to this bit allows the SOPT1[USBVSTBY] bit to be written. This
 * register bit clears after a write to SOPT1[USBVSTBY].
 *
 * @param base     Base address for current SIM instance.
 * @param enable   USB voltage regulator VLP standby write enable setting
 *                  - true: SOPT1[USBSSTBY] can be written.
 *                  - false: SOPT1[USBSSTBY] cannot be written.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorInStdbyDuringVlprwCmd(SIM_Type * base, bool enable)
{
    SIM_BWR_SOPT1CFG_UVSWE(base, enable ? 1 : 0);
}

/*!
 * @brief Gets the USB voltage regulator VLP standby write enable setting.
 *
 * This function  gets the USB voltage regulator VLP standby write enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return enabled True if the USB voltage regulator VLP standby write is enabled.
 */
static inline bool SIM_HAL_GetUsbVoltRegulatorInStdbyDuringVlprwCmd(SIM_Type * base)
{
    return SIM_BRD_SOPT1CFG_UVSWE(base);
}

/*!
 * @brief Sets the USB voltage regulator enable write enable setting.
 *
 * This function  controls whether the USB voltage regulator write enable
 * feature is enabled. Writing one to this bit allows the SOPT1[USBREGEN] bit to be written.
 * This register bit clears after a write to SOPT1[USBREGEN].
 *
 * @param base     Base address for current SIM instance.
 * @param enable   USB voltage regulator enable write enable setting
 *                  - true: SOPT1[USBSSTBY] can be written.
 *                  - false: SOPT1[USBSSTBY] cannot be written.
 */
static inline void SIM_HAL_SetUsbVoltRegulatorWriteCmd(SIM_Type * base, bool enable)
{
    SIM_BWR_SOPT1CFG_URWE(base, enable ? 1 : 0);
}

/*!
 * @brief Gets the USB voltage regulator enable write enable setting.
 *
 * This function  gets the USB voltage regulator enable write enable setting.
 *
 * @param base     Base address for current SIM instance.
 * @return enabled True if USB voltage regulator enable write is enabled.
 */
static inline bool SIM_HAL_GetUsbVoltRegulatorWriteCmd(SIM_Type * base)
{
    return SIM_BRD_SOPT1CFG_URWE(base);
}
#endif //FSL_FEATURE_SOC_USB_COUNT

/*!
* @brief Sets the ADCx alternate trigger enable setting.
*
* This function enables/disables the alternative conversion triggers for ADCx.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param enable Enable alternative conversion triggers for ADCx
*               - true:  Select alternative conversion trigger.
*               - false: Select PDB trigger.
*/
static inline void SIM_HAL_SetAdcAlternativeTriggerCmd(SIM_Type * base,
                                                       uint32_t instance,
                                                       bool enable)
{
    SIM_BWR_SOPT7_ADC0ALTTRGEN(base, enable ? 1 : 0);
    
